import 'package:flutter/material.dart';

class YogaBenefitsPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text('فوائد اليوغا'),
      ),
      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text(
                'فوائد اليوغا الصحية والنفسية في اليوم العالمي لليوغا',
                style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 10),
              Text(
                'باتت اليوغا واحدة من أكثر الأنشطة البدنية رواجاً، حيث يقوم بمزاولتها نحو عشرات الملايين حول العالم، نظراً لفوائدها الكبيرة على الصحة الجسدية والنفسية. وفي اليوم العالمي لليوغا الذي يُحتفى به كل عام في مثل هذا اليوم، بتاريخ الـ21 من شهر يونيو، يُطلعك "سيدتي نت" على فوائد هذه الرياضة:',
                style: TextStyle(fontSize: 16),
              ),
              SizedBox(height: 20),
              Text(
                'فوائد اليوجا للصحة النفسية والعقلية',
                style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
              ),
              SizedBox(height: 5),
              Text(
                'تفيد اليوغا في تحسين الصحة النفسية، من خلال:',
                style: TextStyle(fontSize: 16),
              ),
              SizedBox(height: 10),
              Text(
                '- الشعور بالسعادة\n'
                    'تطلق اليوغا عند ممارستها مواد كيميائية تبعث على الشعور بالسعادة في الدماغ. وتشمل المواد الكيميائية المعززة للمزاج رسل الدماغ مثل الدوبامين والسيروتونين والنورادرينالين.',
                style: TextStyle(fontSize: 16),
              ),
              SizedBox(height: 10),
              Text(
                '- تخفيف الاكتئاب\n'
                    'تشير الدراسات إلى أن اليوغا يمكن أن تخفف من الاكتئاب. ووجد الباحثون أن اليوجا يمكن مقارنتها بالعلاجات الأخرى، مثل الأدوية والعلاج النفسي. كما يمكن أن تفيد حتى أولئك الذين يعانون من اضطراب الاكتئاب الشديد. وثبت أن كل من علاجات اليوغا القائمة على الحركة والممارسات القائمة على التنفس تحسّن بشكل كبير أعراض الاكتئاب.',
                style: TextStyle(fontSize: 16),
              ),
              SizedBox(height: 10),
              Text(
                '- الحد من التوتر\n'
                    'يمكن لشد العضلات واسترخائها أن يقلل من التوتر. قد تستفيدين أيضاً من الأجواء الهادئة والموسيقى الهادئة والسلوك الإيجابي الذي ستجدينه في معظم دروس اليوغا.',
                style: TextStyle(fontSize: 16),
              ),
              SizedBox(height: 10),
              Text(
                '- تخفيف القلق\n'
                    'قد تكون تمارين التنفس المتضمنة في اليوغا فعّالة بشكل خاص في التخفيف من حدّة القلق، حيث توجد علاقة بين القلق ومشاكل التنفس.',
                style: TextStyle(fontSize: 16),
              ),
              SizedBox(height: 10),
              Text(
                '- جودة النوم\n'
                    'ثبت أن اليوغا تُحسِّن من سرعة النوم؛ هذا يرجع جزئياً إلى آثار ما بعد التمرين والتهدئة الذهنية وتخفيف التوتر الذي توفره اليوغا على وجه التحديد. كما تُظهر العديد من الدراسات أن اليوجا نيدرا مفيدة بشكل خاص في تحسين النوم.',
                style: TextStyle(fontSize: 16),
              ),
              SizedBox(height: 10),
              Text(
                '- احترام الذات\n'
                    'غالباً ما تكون صورة الجسد واحترام الذات تحدياً خاصاً للمراهقين والشباب. والخبر السارّ هو أن العديد من الدراسات الحديثة يُظهر نتائج إيجابية عند استخدام اليوغا لتحسين احترام الذات وصورة الجسم المتصورة لدى هؤلاء.',
                style: TextStyle(fontSize: 16),
              ),
              SizedBox(height: 10),
              Text(
                '- تعزز العادات الصحية الأخرى\n'
                    'إذا كنت تمارسين اليوغا، فمن المرجح أن تختاري المزيد من الأطعمة الصحية. قد تكون اليوغا أيضاً بوابة لأنواع أخرى من النشاط البدني. يمكن أن يلهمك التعرّض للأشخاص المهتمين بالصحة لإجراء تغييرات إيجابية أخرى في نمط حياتك المتبع.',
                style: TextStyle(fontSize: 16),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
