const Map<String,String> ar ={
"إعدادات" : "إعدادات",
"اللغه" : "اللغه",
"تغيير كلمة السر" : "تغيير كلمة السر",
"حساب تعريفي" : "حساب تعريفي",
"تعيينات" :  "تعيينات",
"يستكشف" :  "يستكشف",
"محادثه" :  "محادثه",
"الرئيسية" :  "الرئيسية",
"تعديل الملف الشخصي" : "تعديل الملف الشخصي",
"الاعتمادات والكوبونات" : "الاعتمادات والكوبونات",
"اضافه الاصدقاء" : "اضافه الاصدقاء",
"مركز المساعده" : "مركز المساعده",
"المدفوعات" : "المدفوعات",
"عام  " : "عام  ",
"إشعارات" : "إشعارات",
"الثيم" : "الثيم",
"اخرى  " : "اخرى  ",
"سياسة الخصوصية" : "سياسة الخصوصية",
"الدعم" : "الدعم",
"البنود و الظروف" :"البنود و الظروف",
"تسجيل الخروج" : "تسجيل الخروج",
"هل أنت متأكد أنك تريد تسجيل الخروج " : "هل أنت متأكد أنك تريد تسجيل الخروج ",
'نعم ' :'نعم ',
'الغاء' : 'الغاء',
"لماذا" : "لماذا",
"تولي مسؤولية رفاهيتك" : "تولي مسؤولية رفاهيتك",

'Bliss Mate موجود هنا لدعمك في رحلتك نحو تحسين الصحة العقلية والرفاهية. بفضل مجموعة من الميزات والموارد، نساعدك على إعطاء الأولوية للرعاية الذاتية وإدارة التوتر وتعزيز التوازن العاطفي.':
'Bliss Mate موجود هنا لدعمك في رحلتك نحو تحسين الصحة العقلية والرفاهية. بفضل مجموعة من الميزات والموارد، نساعدك على إعطاء الأولوية للرعاية الذاتية وإدارة التوتر وتعزيز التوازن العاطفي.',
"ابحث عن السلام مع": "ابحث عن السلام مع",
'استكشف مكتبتنا من جلسات التأمل الموجهة المصممة لتقليل التوتر وتحسين التركيز وتعزيز الاسترخاء من خلال التقنيات التي يمكن أن تساعدك على تنمية الوعي باللحظة الحالية والعثور على الهدوء الداخلي وتعزيز': 'استكشف مكتبتنا من جلسات التأمل الموجهة المصممة لتقليل التوتر وتحسين التركيز وتعزيز الاسترخاء من خلال التقنيات التي يمكن أن تساعدك على تنمية الوعي باللحظة الحالية والعثور على الهدوء الداخلي وتعزيز',
"تواصل مع دكاتره متخصصين في": "تواصل مع دكاتره متخصصين في",
'انضم إلى المناقشات، واطلب المشورة، معًا، يمكننا تقديم الدعم والتشجيع والإلهام في طريقك إلى العافية. أنـت لست وحيدا في هذا.' :' انضم إلى المناقشات، واطلب المشورة، معًا، يمكننا تقديم الدعم والتشجيع والإلهام في طريقك إلى العافية. أنـت لست وحيدا في هذا.',
" تخطى ":" تخطى ",
"تسجيل الدخول": "تسجيل الدخول",
"اسم المستحدم" : "اسم المستحدم",
'       العمر': '       العمر',
'       الهاتف' : '       الهاتف',
"حفظ" :  "حفظ",
"تعديل كلمه المرور" : "تعديل كلمه المرور",
"معالج بليس ميت" : "معالج بليس ميت",
'...أكتب رسالتك هنا' : '...أكتب رسالتك هنا',
"لمحه عامه" :  "لمحه عامه" ,
'الاكتئاب' :  'الاكتئاب',
'لاضطراب الاكتئابي (المعروف أيضاً باسم الاكتئاب) هو اضطراب' :  'لاضطراب الاكتئابي (المعروف أيضاً باسم الاكتئاب) هو اضطراب',
'قلق' :'قلق',
"إختلال النوم" :  "إختلال النوم",
'ضغط' : 'ضغط',
'رهاب' :'رهاب',
'اضطراب في الشخصية' :'اضطراب في الشخصية',
'تمارين' :'تمارين',
'التمارين المتاحة' : 'التمارين المتاحة',
"مرحبا بك في" :  "مرحبا بك في",
"أخبرنا عن مشاكلك، ونحن سوف نساعدك" : "أخبرنا عن مشاكلك، ونحن سوف نساعدك",
"اشتراك" : "اشتراك",
"اضافة قائمة تشغيل جديدة" : "اضافة قائمة تشغيل جديدة",
'إضافة قائمة جديدة' :'إضافة قائمة جديدة',
'اسم القائمة' : 'اسم القائمة',
'إلغاء' : 'إلغاء',
'إضافة' : 'إضافة',
"الموسيقى المفضلة لديك" :  "الموسيقى المفضلة لديك",
"اختيار ملف صوتي" : "اختيار ملف صوتي",
"لمحة عامة": "لمحة عامة",
'الكل' : 'الكل',
'اليوجا' :'اليوجا',
'التامل' :'التامل',
'موسيقى' :'موسيقى',
'الاسم الأول' : 'الاسم الأول' ,
"ادخل اسمك الاول " :"ادخل اسمك الاول ",
"ادخل اسمك الثانى" :  "ادخل اسمك الثانى",
'الاسم الثانى' :  'الاسم الثانى' ,
"ادخل البريد الالكترونى" :"ادخل البريد الالكترونى",
"بريد إلكتروني" : "بريد إلكتروني" ,
"كلمة المرور" : "كلمة المرور",
"ادخل كلمه المرور" :"ادخل كلمه المرور",
"استكشف" : "استكشف",
"حجوزات" :"حجوزات",
"  ادخل على الاققل 10 حروف و ارقام و ورمز خاص " :"  ادخل على الاققل 10 حروف و ارقام و ورمز خاص ",
'هذا الحساب غير موجود حاول  مره ثانيه' :'هذا الحساب غير موجود حاول  مره ثانيه',
'لقد تم تسجيل دخولك بنجاح' :'لقد تم تسجيل دخولك بنجاح',
'اسم المستخدم' :'اسم المستخدم',
"ادخل كلمة المرور الحالية" :"ادخل كلمة المرور الحالية",
"كلمة المرور الحالية" :"كلمة المرور الحالية",
"ادخل كلمة المرور الجديدة" : "ادخل كلمة المرور الجديدة",
"كلمة المرور الجديدة" : "كلمة المرور الجديدة" ,
"ادخل تأكيد كلمة المرور الجديدة" :"ادخل تأكيد كلمة المرور الجديدة",
"كلمة المرور غير متطابقة" : "كلمة المرور غير متطابقة" ,
"تأكيد كلمة المرور الجديدة":  "تأكيد كلمة المرور الجديدة",
"تأكيد التغييرات" :  "تأكيد التغييرات",
": تابع حسابتنا على وسائل التواصل الاجتماعى  " :  ": تابع حسابتنا على وسائل التواصل الاجتماعى  ",
'إيقاف' :'إيقاف',
'تشغيل' :'تشغيل',
"ادخل تاكيد كلمه المرور" : "ادخل تاكيد كلمه المرور",
" كلمه المرور غير متطابقه" :" كلمه المرور غير متطابقه",
" تاكيد كلمه المرور" :  " تاكيد كلمه المرور",
'فشل تسجيل حسابك ! حاول مره اخرى ' :'فشل تسجيل حسابك ! حاول مره اخرى ',
'لقد تم تسجيل حسابك بنجاح ..اذهب وسجل دخولك' : 'لقد تم تسجيل حسابك بنجاح ..اذهب وسجل دخولك',
"سمة" :"سمة",
"حماية رمز المرور" :"حماية رمز المرور",
"ليلى" :"ليلى",
"اللغه الانجليزيه" :"اللغه الانجليزيه",
"اللغه العربيه" :"اللغه العربيه",
"تسجيل خروج" :"تسجيل خروج",
"نعم. قم بتسجيل الخروج" : "نعم. قم بتسجيل الخروج",
  "الملف الشخصي" : "الملف الشخصي",
  "عرض و تحرير ملفك الشخصي" : "عرض و تحرير ملفك الشخصي",
  "الإعدادات العامة  " : "الإعدادات العامة  ",
  "تحرير الملف الشخصي" : "تحرير الملف الشخصي",
  "تغيير كلمة المرور" :"تغيير كلمة المرور",
  "الوضع الداكن" : "الوضع الداكن",
  " إعدادات الحساب " : " إعدادات الحساب ",
  "طريقه الدفع" :"طريقه الدفع",
  "مركز الساعده" :"مركز الساعده",
  "دعوة الأصدقاء" : "دعوة الأصدقاء",
  "الشروط و الأحكام" :"الشروط و الأحكام",
  'بريد إلكترونى' :  'بريد إلكترونى',
  'هاتف' : 'هاتف' ,
  'تاريخ الميلاد ' :  'تاريخ الميلاد ',
  'عنوان' :'عنوان',
  "الإشعارات" : "الإشعارات" ,
  "نغمة المحادثات" :"نغمة المحادثات",
  "تشغيل الأصوات للرسائل الواردة والصادرة" :"تشغيل الأصوات للرسائل الواردة والصادرة",
  "الرسائل" : "الرسائل",
  "نغمة الاشعارات" : "نغمة الاشعارات",
  "اهتزاز" : "اهتزاز",
  "التلقائي" : "التلقائي",
  "محادثة" :"محادثة",
  "تأكيد مسح المحادثة" : "تأكيد مسح المحادثة",
  "هل تريد بالفعل مسح محتويات الشات؟" : "هل تريد بالفعل مسح محتويات الشات؟",
  "نعم" :"نعم",
  "لا" : "لا",
  'أكتب رسالتك هنا...':'أكتب رسالتك هنا...',
  "تاريخ الاستشارات" :"تاريخ الاستشارات",
  "اليوم-20 مايو 2024":"اليوم-20 مايو 2024",
  "رسالة. ":"رسالة. ",
  "مكتمل":"مكتمل",
  "ماريا كرم":"ماريا كرم",
  "تم الرد في الساعة 4:00 مساء":"تم الرد في الساعة 4:00 مساء",
  "ميعاد. ":"ميعاد. ",
  "زياد الشرقاوي":"زياد الشرقاوي",
  "4:00 مساء - 5:00 مساء":"4:00 مساء - 5:00 مساء",
  "تم الإلغاء بواسطة المريض":"تم الإلغاء بواسطة المريض",
  "بسنت احمد":"بسنت احمد",
  "7:00 مساء - 8:00 مساء":"7:00 مساء - 8:00 مساء",
  "19 أبريل 2024":"19 أبريل 2024",
  "لارا علاء":"لارا علاء",
  "3:00 مساء - 4:00 مساء":"3:00 مساء - 4:00 مساء",
  "نور بسام":"نور بسام",
  "جدول المواعيد":"جدول المواعيد",
  "إدارة المرضى":"إدارة المرضى",
  "جينا احمد":"جينا احمد",
  "أنثى   .24 سنة ":"أنثى   .24 سنة ",
  "بسام نور":"بسام نور",
  " ذكر   .28 سنة":" ذكر   .28 سنة",
  "أنثى   .21 سنة ":"أنثى   .21 سنة ",
  "سيليا سمير":"سيليا سمير",
  "أنثى   .30 سنة ":"أنثى   .30 سنة ",
  "عمر عادل":"عمر عادل",
  "ذكر   .24 سنة ":"ذكر   .24 سنة ",
  "جورج بيتر":"جورج بيتر",
  "ذكر   .26 سنة ":"ذكر   .26 سنة ",
  '  اكتب نبذة مختصرة عنك  ':'  اكتب نبذة مختصرة عنك  ',
  '   ادخل التعليم و التخصص    ':'   ادخل التعليم و التخصص    ',
  "قم بتحديد مواعيد العمل و الحجز المتاحة":"قم بتحديد مواعيد العمل و الحجز المتاحة",
  'ملخص:':'ملخص:',
  "استشارات اليوم":"استشارات اليوم",
  "تم الإنتهاء من 5 من 10":"تم الإنتهاء من 5 من 10",
  "إدارة المرضي" :"إدارة المرضي",
  "استشارات مجانية":"استشارات مجانية",
  'لم يتم اختيار أي ملف صوتي.':'لم يتم اختيار أي ملف صوتي.',
  "اليوم-20مايو2024":"اليوم-20مايو2024",
  "لديك موعد مع د.احمد اسماعيل اليوم في الساعة7:00 م":"لديك موعد مع د.احمد اسماعيل اليوم في الساعة7:00 م",
  "الآن":"الآن",
  "منذ 25 دقيقة":"منذ 25 دقيقة",
  "منذ 2 ساعات":"منذ 2 ساعات",
  "19أبريل2024":"19أبريل2024",
  "أمس.7:58 صباحآ":"أمس.7:58 صباحآ",
  "لديك موعد مع د.احمد اسماعيل اليوم في الساعة5:00 م":"لديك موعد مع د.احمد اسماعيل اليوم في الساعة5:00 م",
  "أمس.9:58 صباحآ":"أمس.9:58 صباحآ",
  "لديك موعد مع سارة ابراهيم الساعه 08:00 مساء اليوم.":"لديك موعد مع سارة ابراهيم الساعه 08:00 مساء اليوم.",
  "أكمل ملفك الشخصي لتكون مستشارآ صحيآ أفضل. ملف كامل":"أكمل ملفك الشخصي لتكون مستشارآ صحيآ أفضل. ملف كامل",
  "أضف حسابآ مصرفيآ لسحب دخلك.":"أضف حسابآ مصرفيآ لسحب دخلك.",
  "أضف الآن >":"أضف الآن >",
  "لديك موعد مع ليلى باسم الساعة05:00 مساء اليوم.":"لديك موعد مع ليلى باسم الساعة05:00 مساء اليوم.",
  "أمس.10:58 صباحآ":"أمس.10:58 صباحآ",
  "لديك طلب مكالمة صوتية من علي فى الساعة08:20 صباحآ اليوم.":"لديك طلب مكالمة صوتية من علي فى الساعة08:20 صباحآ اليوم.",
  "لديك موعد مع كريم عزت الساعة05:00 مساء اليوم.":"لديك موعد مع كريم عزت الساعة05:00 مساء اليوم.",
  "أمس.الساعة2:00 صباحآ":"أمس.الساعة2:00 صباحآ",
  "اهلا بك  ":"اهلا بك  ",
  "اختر فئتك":"اختر فئتك",
  "معالج نفسي":"معالج نفسي",
  "مريض":"مريض",
  "الصفحة الرئيسية":"الصفحة الرئيسية",
  "مرحبآ":"مرحبآ",
  "ليلي":"ليلي",
  "مشاركة عبر":"مشاركة عبر",
  "نسخ الرابط": "نسخ الرابط",
  "انستجرام":"انستجرام",
  "فيسبوك":"فيسبوك",
  "واتساب":"واتساب",
  "ادعو أصدقاء":"ادعو أصدقاء",
















































































































};